<?
$GLOBALS['_STRINGS']['img']=array(
TITLE=>"Альбомы изображений",

TIMGINDEX_ABOUT=>"Постраничное отображение галереи изображений",
P_BINDTO=>"К какому объекту относятся изображения",
TIMGINDEX_P_COLUMNCOUNT=>"Количество колонок",
TIMGINDEX_P_TN_FORMAT=>"Какой формат сохраненных изображений показывать в таблице",
TIMGINDEX_P_SHOWCAPTIONS=>"Показывать подписи к изображениям",
TIMGINDEX_T_SAVEMEFIRST=>"Вы сможете добавить изображения сразу после сохранения этого элемента",
SELECT_GLOBAL_ALBUM=>"Общий альбом изображений сайта",
SELECT_EMPTY_IMAGE=>"Выберите изображение, которое будет показано вместо пустого",

ADD_NEW_IMAGE=>"Добавить изображение",

IMAGE_ALIGNMENT=>"Позиция изображения",
ALIGN_LEFT=>"Влево",
ALIGN_RIGHT=>"Вправо",
ALIGN_CENTER=>"По центру",
ALIGN=>"Позиция по горизонтали",
TIMGINDEX_MSG_DYNAMICMODE=>"Вы не можете редактировать содержимое, так как здесь будут отображаться изображения, относящиеся к другому объекту",
IMGVIEW_CONTEXT=>"Виртуальный раздел, который будет использоваться для отображения полноразмерного изображения",

TN_FORMAT=>"Формат миниатюры изображения",
TIMGCONTAINER_ABOUT=>"Контейнер для хранения изоражений на веб-странице",
ORIGINAL=>"Сохраненное изображение",
MAXIMGSIZE=>"Максимальный размер сохраняемого изображения",

TIMAGE_C_ZOOMABLE=>"При нажатии показывать изображение в полный размер",

IMAGE_P_ONSHOW=>"При нажатии на изображение можно открыть изображение как в новом окне, так и отобразить в мониторе изображений, которые надо указать",
IMAGE_V_ONSHOW_MODALWINDOW=>"открывать в модальном окне",
IMAGE_V_ONSHOW_WINDOW=>"открывать новое popup-окно",
IMAGE_V_ONSHOW_IMGMONITOR=>"отображать в мониторе изображений",
IMAGE_V_ONSHOW_NEWBLANKWINDOW=>"открывать в новой пустой странице броузера",
IMAGE_V_ONSHOW_OPENCONTEXT=>"открыть страницу сайта с изображением в ImgViewContext",
IMAGE_V_ONSHOW_OPENCONTEXT_MODALWINDOW=>"открыть модальное окно со страницей изображением в ImgViewContext",
IMAGE_V_ONSHOW_OPENCONTEXT_BLANK=>"открыть страницу сайта с изображением в ImgViewContext в новом окне",
IMAGE_V_ONSHOW_NONE=>"ничего",
IMAGE_TARGETURL=>"Ссылка на web ресурс или страницу сайта, который будет открыт посетителю при нажатии на миниатюру",
P_BINDTOMONITOR=>"Если на странице есть монитор, то укажите его для отображения полноразмерных картинок",



ERROR_TOO_LARGE_FILE=>"Слишком большой файл изображения. Уменьшите размер изображения перед отправкой.",
ERROR_DURING_UPLOAD=>"Ошибка отправки файла. Попробуйте еще раз",
ERROR_NOT_IMAGE=>"Неправильный тип файла. Это должно быть изображение типа JPG/GIF/PNG. Некоторые типы JPG не поддерживаются системой (например в CMYK модели)",
ERROR_NOT_JPEG=>"Необходимо отправлять только файлы типа JPEG. Вы отправили",
ERROR_BINDTO=>"Неправильная ссылка на родительский объект",
ERROR_OBJECTPATH=>"Неправильный путь к объекту изображения",

IMAGE_REGENERATE=>"Регенерировать",
IMAGE_REMOVE=>"Удалить",
IMAGE_DUMMYCAPTION=>"Нажмите, чтобы добавить",


TIMAGE_ABOUT=>"Одиночное изображение с подписью",
TIMAGE_P_BINDTOOWNER=>"К объекту относится изображение",
TIMAGE_CAPTION=>"Изображение",
TIMAGE_LABEL=>"Подпись под изображением",
TIMAGE_ORDERNO=>"Порядковый № изобр. при выводе",
P_CSS_CAPTION=>"Стиль подписи изображения",
P_CSS_BORDER=>"Стиль рамки изображения",
P_CSS_HREF=>"Стиль ссылки",
WATERMARK_FILE=>"Файл водяного знака в углу изображения",
IIMAGE_CLICK_BROWSE_TOADDNEW=>"Нажмите 'Обзор...' и выберите новое изображение",
IIMAGE_CLICK_BROWSE_TO_UPDATE=>"Для замены этого изображения другим файлом нажмите Обзор и выберите другой файл",
TIMAGE_C_DRAWIMAGE_ASIS=>"Рисовать изображение прямо так как оно есть (без миниатюры)",
TIMAGE_WRITEFILE_ERRROR=>"Ошибка записи. Нет прав на запись файлов",
TIMAGE_C_THUMBNAILDIMENSIONS=>"Габариты создаваемых миниатюр изображения",
TIMAGE_C_FIT_TO_THUMBNAIL=>"Изображение обрезается в формат миниатюры",
TIMAGE_MAX_DIMENSIONS=>"Максимальные габариты сохраняемого изображения",
TIMAGE_IMG_BOUNDARY_WARNING=>"Кроме миниатюр на сервере сохраняется исходная версия изображения.
   Чтобы изображение не занимало много места при превышении указанного габарита - оно будет автоматически уменьшено",

TIMAGE_CLOSEPREVIEW=>"Закрыть окно",
TIMAGE_UNKNOWN_OBJECT=>"Не указан ни объект ни к чему надо привязывать новые",
TIMAGE_BAD_BINDING=>"Указан неправильный объект привязки 'img.BindToOwner'",
TIMAGE_EDITCONTENT=>"Вставить изображение",

ACCESS_POSTIMAGES=>"Редактирование изображений",

IMGCONTAINER_SOCKET=>"Содержимое контейнера изображений",
IMGCONTAINER_EDITCONTENT=>"Редактировать изображения",
IMGCONTAINER_CONTROLINTRO=>"Контейнер изображений. Содержит изображения следующих форматов:",
TIMGMONITOR_ABOUT=>"Монитор для отображения изображений",
IMGMONITOR_CAPTIONINSIDE=>"Надпись внутри монитора, когда никакое изображение еще не выбрано",
IMGMONITOR_SIZE=>"Размер монитора",
IMGMONITOR_FITINSIDE=>"Уменьшать изображения, которые крупнее чем указанный габарит",
IMGMONITOR_SHOWFORMAT=>"Какой формат изображения отображать в мониторе",
IMGMONITOR_CAPTIONINSIDE_SAMPLE=>"Выберите изображение и нажмите на него",

TIMGDETAILS_ABOUT=>"Загрузка информации об изображении",
TIMGDETAILS_CAPTION=>"Подпись под изображением",
TIMGDETAILS_THEIMAGE=>"Изображение",
TIMGDETAILS_BINDTO=>"К чему относится просматриваемое изображение",

MENU_IMAGES=>"Изображения",
IMG_ALBUMS=>"Альбомы изображений",
IMG_ALBUMCONTEXTS=>"Форматы присоединяемых альбомов",
IMG_IMAGEFORMATS=>"Форматы изображений",
SELECT_THUMBNAIL_TO_VIEW=>"Посмотреть сохраненные миниатюры",

TIMAGE_DESCRIPTION=>'Показывает одно из присоединенных изображений к объекту или из общего альбома',
TIMGINDEX_CAPTION=>'Альбом',
TIMGINDEX_DESCRIPTION=>'Показывает изображения из общего альбома или альбома, присоединенного к какому-либо объекту (TNewsEvent:Header, TNewsEvent:Gallery, TProduct и т.д.)',
TMONITOR_CAPTION=>'Монитор для показа изображений',
TMONITOR_DESCRIPTION=>'Используется совместно с ImgIndex. При нажатии на миниатюру в альбоме, монитор показывает исходную версию изображения',

IMG_FORMAT_NONE=>"Не изменять",
IMG_FORMAT_NAME=>"Название формата миниатюры",
IMG_FORMAT_CROP=>"Обрезка изображения под формат пользователем",
IMG_FORMAT_FIT=>"Масштабирование под формат",
IMG_FORMAT_COLOR=>"Размещение изображения пользователем на фоне цвета bgColor",
IMG_FORMAT_IMG=>"Пользователь самостоятельно загружает миниатюру",
IMG_FORMAT_TN_ORIGINAL=>"Исходное сохраняемое изображение",
IMG_FORMAT_TN_FORMATNO=>"Миниатюра №",
IMG_FORMAT_RECOMMENDATION=>"Рекомендуемый габарит для сохранения исходного изображения: Масштабирование под формат 800х600",
IMG_FORMAT_RESIZEOPTION=>"Способ уменьшения изображения",
IMG_FORMAT_SIZE=>"Габарит (ширина x высота)",
IMG_FORMAT_BGCOLOR=>"Цвет фона (для способа 'резмещение')",
IMG_FORMAT_WATERMARKFILE=>"png-Файл для наложения на миниатюру",
IMG_FORMAT_CONVERTTO=>"Преобразовать в формат",

IMAGEALBUM_ADDNEW=>"Добавить новый альбом",
IMAGEALBUM_NAME=>"Название альбома",
IMAGEALBUM_OPEN=>"Открыть альбом",
IMAGEALBUM_DESCRIPTION=>"Описание",

CHANGE_IMAGE_FORMAT=>"Сменить формат",
CHOOSE_IMAGE_FORMAT=>"Выберите формат изображения",
DONT_FORGET_TO_REGENERATE=>"После замены формата изображения не забудьте произвести регенерацию изображений",
EMPTY_ALBUM=>"Альбом пуст",
IMAGES_INSIDE=>"изображений внутри",
CHOOSE_THUMBNAIL_FORMAT=>"Выберите формат миниатюры",


);
?>
